Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རིམ་གྲོ་པ་ནི་ཀུན་དུ་གནས་ཞེས་བྱའོ། །
en: Universal Abiding will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐུ་རྩལ་སྤྱོད་ཅེས་བྱའོ། །
en: Powerful Conduct will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་མཐའ་ཡས་གྲགས་ཞེས་བྱའོ། །
en: Renown of Infinite Qualities will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be fifty consecutive congregations, each of them gathering one trillion.

source: མཆོད་རྟེན་ནི་དཔག་ཚད་བཅྭ་ལྔ་པ་སྟེ་གཅིག་ཏུ་ཟད་དོ། །
en: There will also only be a single stūpa, measuring fifteen leagues.

source: དེ་བཞིན་གཤེགས་པ་ཏོག་གི་རྒྱལ་མཚན་སྐྱེ་བའི་ཡུལ་ནི་ཏོག་གི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Ketudhvaja will be born in a place called Radiant Crest.

source: ཡབ་ནི་བསོད་ནམས་ཏོག་ཅེས་བྱའོ། །
en: Crest of Merit will be his father.

source: ཡུམ་ནི་བདེན་སྨྲ་ཞེས་བྱའོ། །
en: Truth Speaker will be his mother.

source: སྲས་ནི་ཤེས་རབ་དབྱངས་ཞེས་བྱའོ། །
en: Melody of Insight will be his son.

source: རིམ་གྲོ་པ་ནི་ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཚོགས་ཞེས་བྱའོ། །
en: Gathering of All Qualities will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Mind will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡིད་འོང་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Endearing Power will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དྲུག་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་འབུམ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དགུ་ཡོད་དོ། །
en: There will be sixty consecutive congregations, each of them gathering nine million nine hundred thousand irreversible bodhisattvas.

source: དེ་བཞིན་གཤེགས་པ་བདེ་བར་དགོངས་སྐྱེ་བའི་ཡུལ་ནི་བདེ་བ་ཅན་ཞེས་བྱའོ། །
en: “The thus-gone Sukhacittin will be born in a place called Blissful.

source: འོད་ནི་དཔག་ཚད་སྟོང་ཉིས་བརྒྱའོ། །
en: His light will extend one thousand two hundred leagues.

source: ཡབ་ནི་ཐར་སེམས་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Liberated Mind will be his father.

source: སྲས་ནི་དོན་གྱི་བློ་གྲོས་ཞེས་བྱའོ། །
en: Ultimate Intelligence will be his son.

source: རིམ་གྲོ་པ་ནི་ཐར་པའི་མཛོད་ཅེས་བྱའོ། །
en: Treasury of Liberation will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་སྟོབས་ཞེས་བྱའོ། །
en: Lion Strength will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བློ་གྲོས་དག་པའི་དོན་ཅེས་བྱའོ། །
en: The Meaning of Pure Intelligence will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་བཅྭ་བརྒྱད་བཅྭ་བརྒྱད་དོ། །
en: There will be thirty-six consecutive congregations, each of them gathering eighteen billion.

source: དམ་པའི་ཆོས་ནི་ལོ་བརྒྱད་ཁྲི་བརྒྱད་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for eighty-eight thousand years.

source: དེ་བཞིན་གཤེགས་པ་གཏི་མུག་མེད་པའི་རྒྱལ་པོ་སྐྱེ་བའི་ཡུལ་ནི་མཆོག་ཏུ་སྤོང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Vimoharāja will be born in a place called Supreme Relinquishment.

source: ཡབ་ནི་ལྷ་མཆོད་ཅེས་བྱའོ། །
en: Divine Worship will be his father.

source: སྲས་ནི་རྩལ་པོ་ཆེ་ཞེས་བྱའོ། །
en: Great Strength will be his son.

source: རིམ་གྲོ་པ་ནི་མཐུ་རྩལ་མཐོང་ཞེས་བྱའོ། །
en: Perception of Power will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་གྱི་ཚོགས་ཐམས་ཅད་རབ་ཏུ་གནས་པ་ཞེས་བྱའོ། །
en: Dwelling within the Full Gathering of Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དབྱངས་སྙན་གནས་ཞེས་བྱའོ། །
en: Dwelling in Beautiful Melody will be foremost in terms of miraculous abilities.

source: མཆོད་རྟེན་ནི་དཔག་ཚད་དྲུག་པ་སྟེ་གཅིག་ཏུ་ཟད་དོ། །
en: There will also only be a single stūpa, measuring six leagues.

source: དེ་བཞིན་གཤེགས་པ་ཆོག་མཁྱེན་སྐྱེ་བའི་ཡུལ་ནི་སྒྲོན་མ་མཆོག་ཅེས་བྱའོ། །
en: “The thus-gone Vidhijña will be born in a place called Supreme Lamp.

source: ཡབ་ནི་ཏོག་ཅེས་བྱའོ། །
en: Crest will be his father.

source: ཡུམ་ནི་ཡིད་འཐད་དཔལ་ཞེས་བྱའོ། །
en: Glorious Reasoning Mind will be his mother.

source: རིམ་གྲོ་པ་ནི་ཞུམ་མེད་ཅེས་བྱའོ། །
en: Undaunted will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་མེ་ཏོག་ཅེས་བྱའོ། །
en: Flower of Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་པའི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Banner of Renown will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་ལྔ་སྟེ། །ཐམས་ཅད་ལ་ཡང་འབུམ་ཕྲག་ཉི་ཤུ་རྩ་གསུམ་གསུམ་མོ། །
en: There will be twenty-five consecutive congregations, each of them gathering two million three hundred thousand.

source: མཆོད་རྟེན་ནི་དཔག་ཚད་བདུན་པ་སྟེ་གཅིག་ཏུ་ཟད་དོ། །
en: There will also only be a single stūpa, measuring seven leagues.

source: དེ་བཞིན་གཤེགས་པ་དག་པའི་རྒྱ་མཚོ་སྐྱེ་བའི་ཡུལ་ནི་རྟོགས་པ་སྤོང་བ་ཞེས་བྱའོ། །
en: “The thus-gone Śuddhasāgara will be born in a place called Realization and Relinquishment.

source: ཡབ་ནི་བསོད་ནམས་འཕགས་ཞེས་བྱའོ། །
en: Superior Merit will be his father.

source: ཡུམ་ནི་སྒྲ་གཅན་མེ་ཏོག་ཅེས་བྱའོ། །
en: Sound Bearer Flower will be his mother.

source: སྲས་ནི་མཐུ་རྩལ་འགྲོས་ཞེས་བྱའོ། །
en: Powerful Mode will be his son.

source: རིམ་གྲོ་པ་ནི་བཟང་དཔལ་ཞེས་བྱའོ། །
en: Glorious Excellence will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་བརྩེགས་ཞེས་བྱའོ། །
en: Peak of Qualities will be foremost in terms of insight.

source: འདུས་པ་ནི་ལན་བརྒྱད་ཅུ་རྩ་བཞི་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བརྒྱད་བརྒྱད་དོ། །
en: There will be eighty-four consecutive congregations, each of them gathering eight hundred million.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མངའ་སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་མཐའ་ཡས་ཞེས་བྱའོ། །
en: “The thus-gone Ratnadhara will be born in a place called Infinite Jewel.

source: འོད་ནི་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་ངོ་། །
en: His light will extend eighty-four thousand leagues.

source: ཡབ་ནི་ཤིན་ཏུ་མཐོར་འགྲོ་ཞེས་བྱའོ། །
en: Going Extremely High will be his father.

source: ཡུམ་ནི་སཱ་ལའི་སྒྲ་རྒྱལ་ཞེས་བྱའོ། །
en: Victorious Śāla Sound will be his mother.

source: སྲས་ནི་ལྷའི་འོད་ཟེར་ཞེས་བྱའོ། །
en: Divine Radiance will be his son.

source: རིམ་གྲོ་པ་ནི་ཟླ་གདུགས་ཞེས་བྱའོ། །
en: Moon Parasol will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་ཏོག་མཆོག་ཅེས་བྱའོ། །
en: Supreme Jewel Crest will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདུད་རྩིའི་སྤོས་ཞེས་བྱའོ། །
en: Nectar Fragrance will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་དྲུག་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུ་དགུ་ཡོད་དོ། །
en: There will be sixteen consecutive congregations, each of them gathering nine hundred ninety million.

source: མཆོད་རྟེན་ནི་དཔག་ཚད་བཅུ་གསུམ་པ་སྟེ་གཅིག་ཏུ་ཟད་དོ། །
en: There will also only be a single stūpa, measuring thirteen leagues.

source: དེ་བཞིན་གཤེགས་པ་མི་དམའ་བ་སྐྱེ་བའི་ཡུལ་ནི་འཆི་བ་མེད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Anavanata will be born in a place called Deathless.

source: ཡབ་ནི་དགྲ་འདུལ་ཞེས་བྱའོ། །
en: Subduer of the Enemy will be his father.

source: ཡུམ་ནི་བཞིན་གསལ་མ་ཞེས་བྱའོ། །
en: Luminous Countenance will be his mother.

source: སྲས་ནི་བལྟ་སྡུག་ཅེས་བྱའོ། །
en: Beautiful to Behold will be his son.

source: རིམ་གྲོ་པ་ནི་གཟི་བརྗིད་མཐའ་ཡས་ཞེས་བྱའོ། །
en: Infinite Splendor will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དཔལ་འཛིན་ཞེས་བྱའོ། །
en: Glorious will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཆུ་བོ་སྤོང་ཞེས་བྱའོ། །
en: Abandoning the Rivers will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་གཉིས་གཉིས་སོ། །
en: There will be thirty consecutive congregations, each of them gathering nine hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་སྐྱེ་བོ་དགའ་བར་མཛད་པ་སྐྱེ་བའི་ཡུལ་ནི་འབྱོར་པའི་མཛོད་ཅེས་བྱའོ། །
en: “The thus-gone Jagattoṣaṇa will be born in a place called Treasury of Riches.

source: ཡབ་ནི་ཀླུས་བྱིན་ཞེས་བྱའོ། །
en: Nāga Gift will be his father.

source: ཡུམ་ནི་མཐོང་ལེགས་ཞེས་བྱའོ། །
en: Excellent Sight will be his mother.

source: སྲས་ནི་དྲི་མེད་བློ་ཞེས་བྱའོ། །
en: Stainless Mind will be his son.

source: རིམ་གྲོ་པ་ནི་མཛེས་གྲུབ་ཅེས་བྱའོ། །
en: Beauty Accomplished will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་འོད་ཟེར་ཞེས་བྱའོ། །
en: Radiant Wisdom will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་རྣམ་པར་གྲགས་ཞེས་བྱའོ། །
en: Famed Jewel will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ས་ཡ་ཕྲག་བཞི་བཞིའོ། །
en: There will be ninety consecutive congregations, each of them gathering four million.

source: དམ་པའི་ཆོས་ནི་ལོ་བཞི་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will remain for forty-four thousand years.

source: མཆོད་རྟེན་ནི་དཔག་ཚད་བཅུ་གཅིག་པ་སྟེ་གཅིག་ཏུ་ཟད་དོ།། །།
en: There will also only be a single stūpa, measuring eleven leagues.

source: དེ་བཞིན་གཤེགས་པ་རྨ་བྱའི་ང་རོ་སྐྱེ་བའི་ཡུལ་ནི་སྒྲ་དབྱངས་སྙན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Mayūraruta will be born in a place called Beautiful Melody.

source: ཡབ་ནི་བསོད་ནམས་མཐའ་ཡས་འོད་ཅེས་བྱའོ། །
en: Light of Infinite Merit will be his father.

source: ཡུམ་ནི་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱི་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendor of the Gathering of Merit will be his mother.

source: སྲས་ནི་མཐུ་རྩལ་སྤྱོད་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of Powerful Conduct will be his son.

source: རིམ་གྲོ་པ་ནི་མཆོད་མཐོང་ཞེས་བྱའོ། །
en: Sight of Worship will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཀོད་པ་མཛེས་པར་སྒྲུབ་པར་སེམས་པ་ཞེས་བྱའོ། །
en: Intent on Accomplishing the Array of Beauty will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཏོག་མཆོག་འོད་ཅེས་བྱའོ། །
en: Crest of Supreme Light will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བཞི་བཞིའོ། །
en: There will be ninety consecutive congregations, each of them gathering four hundred million.

source: དེ་བཞིན་གཤེགས་པ་མ་ཞུམ་པ་སྐྱེ་བའི་ཡུལ་ནི་ཟིལ་གྱིས་མི་ནོན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Adīna will be born in a place called Indomitable.

source: ཡུམ་ནི་འོད་བཟངས་ཞེས་བྱའོ། །
en: Excellent Light will be his mother.

source: སྲས་ནི་ཕྱོགས་ལྟ་ཞེས་བྱའོ། །
en: Seeing in All Directions will be his son.

source: རིམ་གྲོ་པ་ནི་དོན་གྱི་ཏོག་ཅེས་བྱའོ། །
en: Ultimate Crest will be his attendant.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐའ་ཡས་ཏོག་ཅེས་བྱའོ། །
en: Infinite Crest will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་འབུམ་འབུམ་མོ། །
en: There will be seventy consecutive congregations, each of them gathering one trillion.

source: དེ་བཞིན་གཤེགས་པ་སྲིད་པའི་སྲེད་པ་དྲི་མ་སྤངས་པ་སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Bhava­tṛṣṇā­mala­prahīṇa will be born in a place called Jewel Light.

source: འོད་ནི་དཔག་ཚད་སུམ་སྟོང་དྲུག་བརྒྱའོ། །
en: His light will extend three thousand six hundred leagues.

source: ཡབ་ནི་རིན་པོ་ཆེའི་ཕུང་པོ་ཞེས་བྱའོ། །
en: Heap of Jewels will be his father.

source: ཡུམ་ནི་གཟི་བརྗིད་གསལ་བ་ཞེས་བྱའོ། །
en: Shining Splendor will be his mother.

source: སྲས་ནི་ཟླ་ལེགས་ཞེས་བྱའོ། །
en: Excellent Moon will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་མཆོག་ཏུ་གྲགས་ཞེས་བྱའོ། །
en: Jewel of Supreme Fame will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གཡོ་བ་མེད་པའི་འགྲོས་ཀྱི་གཟི་བརྗིད་གནས་ཞེས་བྱའོ། །
en: Enduring Splendor of the Immutable Mode will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྷ་དད་སེམས་ཞེས་བྱའོ། །
en: Mind of Divine Faith will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཐེར་འབུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་བཞི་བཞིའོ། །
en: There will be one billion consecutive congregations, each of them gathering four hundred million.

source: དེ་བཞིན་གཤེགས་པ་སྤྱོད་པའི་སྟེགས་སྐྱེ་བའི་ཡུལ་ནི་དགྲ་བཅོམ་བཀོད་ཅེས་བྱའོ། །
en: “The thus-gone Cāritratīrtha will be born in a place called Array of Worthy Ones.

source: ཡབ་ནི་མཛེས་པ་ཞེས་བྱའོ། །
en: Beauty will be his father.

source: སྲས་ནི་ཟླ་མཆོག་ཅེས་བྱའོ། །
en: Supreme Moon will be his son.

source: རིམ་གྲོ་པ་ནི་བཀོད་པ་ཡིད་འོང་མཛེས་ཞེས་བྱའོ། །
en: Array of Attractive Beauty will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐོང་བ་གཡོ་བ་མེད་པར་གནས་ཞེས་བྱའོ། །
en: Dwelling in Immutable Perception will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྣམ་པར་གྲོལ་བས་སྤོང་བའི་གཟི་བརྗིད་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Splendor of Liberated Abandonment will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་དགུ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་དགུ་བཅུ་དགུ་བཅུའོ། །
en: There will be ninety consecutive congregations, each of them gathering nine hundred million.

source: མཆོད་རྟེན་ནི་དཔག་ཚད་བཅུ་དྲུག་པ་སྟེ་གཅིག་ཏུ་ཟད་དོ། །
en: There will also only be a single stūpa, measuring sixteen leagues.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་མང་པོས་སྙན་པར་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: “The thus-gone Bahudevaghuṣṭa will be born in a place called Infinite Fame.

source: ཡབ་ནི་ལྷ་དགའ་ཕྲུག་གུ་ཞེས་བྱའོ། །
en: Joyous Divine Child will be his father.

source: ཡུམ་ནི་པད་མ་དཀར་པོའི་སྤོས་ཞེས་བྱའོ། །
en: White Lotus Fragrance will be his mother.

source: སྲས་ནི་སེང་གེའི་སྟབས་གནས་གཟི་བརྗིད་ཅེས་བྱའོ། །
en: Splendid Lion Strength will be his son.

source: རིམ་གྲོ་པ་ནི་ཟླ་དཔལ་བླ་མ་ཞེས་བྱའོ། །
en: Moon of Highest Glory will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རྒྱན་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: King of the Ornamented Array will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེ་གནས་ཕྲུག་གུ་སྡུག་ཅེས་བྱའོ། །
en: Child of Happiness will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ལྔ་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཕྲག་ལྔ་བཅུ་རྩ་དྲུག་དྲུག་གོ། །
en: There will be fifty consecutive congregations, each of them gathering fifty-six billion.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྟབས་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Ratnakrama will be born in a place called Jewel Light.

source: ཡབ་ནི་ཡུལ་འཁོར་དྲི་མ་མེད་ཅེས་བྱའོ། །
en: Stainless Land will be his father.

source: ཡུམ་ནི་གཙུག་ན་རིན་པོ་ཆེ་ཞེས་བྱའོ། །
en: Jewel Crown will be his mother.

source: སྲས་ནི་ཆོས་འོད་ཅེས་བྱའོ། །
en: Dharma Light will be his son.

source: རིམ་གྲོ་པ་ནི་སྒྲ་དབྱངས་མཆོག་ཅེས་བྱའོ། །
en: Supreme Melody will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཇིག་རྟེན་དགའ་བས་མཆོད་ཅེས་བྱའོ། །
en: Joyous Worship by the World will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སྐྱོན་མེད་རིན་ཆེན་ཞེས་བྱའོ། །
en: Flawless Jewel will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཞི་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་དུང་ཕྱུར་ཕྲག་གསུམ་གསུམ་མོ། །
en: There will be forty consecutive congregations, each of them gathering three hundred million.

source: མཆོད་རྟེན་ནི་དཔག་ཚད་བཅུ་བཞི་པ་སྟེ་གཅིག་ཏུ་ཟད་དོ། །
en: There will also only be a single stūpa, measuring fourteen leagues.

source: དེ་བཞིན་གཤེགས་པ་ཕྱག་ན་པད་མ་བསྣམས་པ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་བཀོད་པ་མཐའ་ཡས་པ་ཞེས་བྱའོ། །
en: “The thus-gone Padmahastin will be born in a place called Infinite Jewel Array.

source: འོད་ནི་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ལྔ་བཅུ་རྩ་བཞི་ཙམ་མོ། །
en: His light will extend as far as fifty-four worlds of four continents.

source: ཡབ་ནི་གནས་པ་ལས་འདས་པ་ཞེས་བྱའོ། །
en: Beyond Abiding will be his father.

source: ཡུམ་ནི་སྐྱོན་མེད་སེམས་ཞེས་བྱའོ། །
en: Flawless Mind will be his mother.

source: སྲས་ནི་གཟི་བརྗིད་ཉི་མ་གསལ་ཞེས་བྱའོ། །
en: Splendid Shining Sun will be his son.

source: རིམ་གྲོ་པ་ནི་དགའ་བ་སྣ་ཚོགས་ལ་གནས་པར་གྲགས་པ་ཞེས་བྱའོ། །
en: Famed for Abiding in Diverse Joys will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་ང་རོ་སྒྲ་སྒྲོགས་ཞེས་བྱའོ། །
en: Lion Roarer will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཐེག་མཆོག་དགའ་ཞེས་བྱའོ། །
en: Joy of the Supreme Vehicle will be foremost in terms of miraculous abilities.

source: སྐུ་ཚེའི་ཚད་ནི་ལོ་བཞི་ཁྲི་བཞི་སྟོང་ངོ་། །
en: The extent of his lifespan will be forty-four thousand years.

source: དམ་པའི་ཆོས་ཀྱང་ལོ་བཞི་ཁྲི་བཞི་སྟོང་གི་བར་དུ་གནས་སོ། །
en: His sacred Dharma will also remain for forty-four thousand years.

source: དེ་བཞིན་གཤེགས་པ་དཔལ་སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་རྒྱལ་པོའི་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Śrī will be born in a place called Light of the King of Splendor.

source: ཡབ་ནི་བློ་གྲོས་བསོད་ནམས་གསལ་ཞེས་བྱའོ། །
en: Clear Intelligence and Merit will be his father.

source: ཡུམ་ནི་ལྟ་མཆོད་ཅེས་བྱའོ། །
en: Divine Worship will be his mother.

source: སྲས་ནི་གཟི་བརྗིད་མཐའ་ཡས་ལྟ་ཞེས་བྱའོ། །
en: God of Infinite Splendor will be his son.

source: རིམ་གྲོ་པ་ནི་ཕྱོགས་དང་ཕྱོགས་མཚམས་འཇིག་རྟེན་མཆོད་ཅེས་བྱའོ། །
en: Worshiped by the World in All the Cardinal and Intercardinal Directions will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མིའི་ཟླ་བ་ཞེས་བྱའོ། །
en: Moon of Humanity will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་དཔག་ཏུ་མེད་པའི་འོད་ཅེས་བྱའོ། །
en: Light of Unfathomable Qualities will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་སུམ་ཅུ་རྩ་གསུམ་སྟེ། ཐམས་ཅད་ལ་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཐེར་འབུམ་ཕྲག་ཉི་ཤུ་ཉི་ཤུའོ། །
en: There will be thirty-three consecutive congregations, each of them gathering twenty-two billion irreversible bodhisattvas.

source: ཐམས་ཅད་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། །དམ་པའི་ཆོས་ནི་ལོ་བྱེ་བའི་བར་དུ་གནས་སོ། །
en: In order to ripen everyone toward awakening, his sacred Dharma will remain for ten million years.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་ལས་རྒྱལ་བ་སྐྱེ་བའི་ཡུལ་ནི་ཁ་དོག་ཟིལ་གྱིས་མི་ནོན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Jitaśatru will be born in a place called Indomitable Hue.

source: འོད་ནི་དཔག་ཚད་དྲུག་སྟོང་དྲུག་བརྒྱའོ། །
en: His light will extend six thousand six hundred leagues.

source: ཡབ་ནི་ལེགས་མཐོང་ཟླ་བ་ཞེས་བྱའོ། །
en: Well-Seen Moon will be his father.

source: ཡུམ་ནི་དགྲ་བཅོམ་དགའ་མཆོད་ཅེས་བྱའོ། །
en: Joyous Worship of the Worthy will be his mother.

source: སྲས་ནི་ཡེ་ཤེས་མཆོག་རིགས་འཛིན་ཅེས་བྱའོ། །
en: Member of the Family of Supreme Wisdom will be his son.

source: རིམ་གྲོ་པ་ནི་ལྟ་སེམས་ཞེས་བྱའོ། །
en: View and Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་སེང་གེའི་མཐུ་རྩལ་སེམས་ཞེས་བྱའོ། །
en: Lion Strength will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་པ་མཐའ་ཡས་གསལ་ཞེས་བྱའོ། །
en: Clear Infinite Fame will be foremost in terms of miraculous abilities.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འདུས་པ་ནི་གྲངས་མེད་དེ། གང་གི་ཉིན་མོ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བའི་ཉིན་མོ་དེ་ཁོ་ན་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ཡང་བྱེད་དོ། །
en: There will be innumerable congregations of bodhisattvas, who will not attain nirvāṇa before the very day they awaken to perfect and complete buddhahood.

source: ཐམས་ཅད་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། དམ་པའི་ཆོས་ནི་ལོ་བདུན་ཁྲིའི་བར་དུ་གནས་སོ། །
en: In order to ripen everyone toward awakening, his sacred Dharma will remain for seventy thousand years.

source: སྐུ་གདུང་ནི་རྒྱས་པར་འགྱུར་རོ། །མཆོད་རྟེན་ནི་ཐེར་འབུམ་ཕྲག་བཅུ་འབྱུང་ངོ་། །
en: His relics will be abundant, and there will be ten billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་འབྱོར་ལྡན་གྲགས་པ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེ་ཐམས་ཅད་བཀོད་པ་ཞེས་བྱའོ། །
en: “The thus-gone Samṛddhayaśas will be born in a place called Array of All Jewels.

source: ཡབ་ནི་རིན་ཆེན་མཆོག་ཅེས་བྱའོ། །
en: Supreme Jewel will be his father.

source: ཡུམ་ནི་ཡོན་ཏན་རིན་ཆེན་འོད་ཅེས་བྱའོ། །
en: Jewel Light of Qualities will be his mother.

source: རིམ་གྲོ་པ་ནི་ཀུན་ཏུ་བཟང་པོ་ཞེས་བྱའོ། །
en: Ever Excellent will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་པོ་ཆེ་ཏོག་གི་རྒྱལ་མཚན་ཞེས་བྱའོ། །
en: Jewel Crest Banner will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་དོན་གྲུབ་བློ་གྲོས་ཞེས་བྱའོ། །
en: Intelligence of Meaningful Accomplishment will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་ཡུལ་འཁོར་བཟང་པོ་སྐྱེ་བའི་ཡུལ་ནི་རིན་པོ་ཆེའི་འོད་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: “The thus-gone Surāṣṭra will be born in a place called Endowed with Jewel Light.

source: ཡབ་ནི་གཟི་བརྗིད་ལེགས་སྦས་ཞེས་བྱའོ། །
en: Well-Concealed Splendor will be his father.

source: རིམ་གྲོ་པ་ནི་རྫུ་འཕྲུལ་ཅན་ཞེས་བྱའོ། །
en: Possessor of Miraculous Power will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བདེན་པའི་ཏོག་ཅེས་བྱའོ། །
en: Truth Crest will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་འཁྲུལ་པ་མེད་པར་གནས་པ་ཞེས་བྱའོ། །
en: Remaining Free from Delusion will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བདུན་ཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་སྟོང་ཕྲག་བཅུ་བཅུའོ། །
en: There will be seventy consecutive congregations, each of them gathering one hundred billion.

source: དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་འོད་སྐྱེ་བའི་ཡུལ་ནི་མེ་ཏོག་ཕུང་པོ་ཞེས་བྱའོ། །
en: “The thus-gone Kusumaprabha will be born in a place called Heap of Flowers.

source: ཡབ་ནི་ཤེད་སྐྱེས་གཙོ་བོ་ཞེས་བྱའོ། །
en: Foremost Human will be his father.

source: ཡུམ་ནི་ཟླ་སྡུག་འོད་ཅེས་བྱའོ། །
en: Lovely Moonlight will be his mother.

source: སྲས་ནི་བལྟ་བས་མཐོང་ཞེས་བྱའོ། །
en: Seen through the View will be his son.

source: རིམ་གྲོ་པ་ནི་བདུད་རྩིའི་སེམས་ཞེས་བྱའོ། །
en: Nectar Mind will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡེ་ཤེས་ཁ་ལོ་སྒྱུར་ཞེས་བྱའོ། །
en: Wisdom Leader will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མེ་ཏོག་མྱ་ངན་འཚང་ཞེས་བྱའོ། །
en: Flower Relieving Suffering will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅྭ་ལྔ་སྟེ། ཐམས་ཅད་ལ་ཡང་བྱེ་བ་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་གཉིས་སོ། །
en: There will be fifteen consecutive congregations, each of them gathering three hundred twenty million.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ང་རོ་སྐྱེ་བའི་ཡུལ་ནི་མི་ཐུབ་པའི་ཚོགས་ཞེས་བྱའོ། །
en: “The thus-gone Siṃhasvara will be born in a place called Indomitable Gathering.

source: སྲས་ནི་སེང་གེའི་མཐུ་རྩལ་ཞེས་བྱའོ། །
en: Lion Strength will be his son.

source: རིམ་གྲོ་པ་ནི་རིན་ཆེན་མེ་ཏོག་ཅེས་བྱའོ། །
en: Jewel Flower will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་མཐའ་ཡས་དབྱངས་ཞེས་བྱའོ། །
en: Infinite Melody will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་བཟང་མཆོག་ཏོག་ཅེས་བྱའོ། །
en: Crest of Supreme Excellence will be foremost in terms of miraculous abilities.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་ལྟར་ཤར་བ་སྐྱེ་བའི་ཡུལ་ནི་གློག་འོད་ཅེས་བྱའོ། །
en: “The thus-gone Candrodgata will be born in a place called Lightning Flash.

source: ཡབ་ནི་བལྟ་སྡུག་ཅེས་བྱའོ། །
en: Beautiful to Behold will be his father.

source: ཡུམ་ནི་ཉི་མའི་བཞིན་ཞེས་བྱའོ། །
en: Sun Face will be his mother.

source: སྲས་ནི་ཀུན་ཏུ་ལྟ་ཞེས་བྱའོ། །
en: Universal Beholding will be his son.

source: རིམ་གྲོ་པ་ནི་ཀུན་ཏུ་མེ་ཏོག་ཅེས་བྱའོ། །
en: Universal Flower will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ཡོན་ཏན་མཐུ་རྩལ་སྟོབས་ཞེས་བྱའོ། །
en: Powerful Strength of Qualities will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་གྲགས་པ་རྒྱ་ཆེན་ཞེས་བྱའོ། །
en: Vast Fame will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་བཅུ་སྟེ། ཐམས་ཅད་ལ་ཡང་འབུམ་འབུམ་མོ། །
en: There will be ten consecutive congregations, each of them gathering one hundred thousand.

source: དེ་བཞིན་གཤེགས་པ་འཇོམས་པའི་མཆོག་སྐྱེ་བའི་ཡུལ་ནི་སྣང་བ་མཐའ་ཡས་ཞེས་བྱའོ། །
en: “The thus-gone Damajyeṣṭha will be born in a place called Infinite Light.

source: ཡབ་ནི་ཙན་དན་བཟང་པོ་ཞེས་བྱའོ། །
en: Excellent Sandalwood will be his father.

source: སྲས་ནི་རིན་ཆེན་དཔལ་ཞེས་བྱའོ། །
en: Glorious Jewel will be his son.

source: རིམ་གྲོ་པ་ནི་མཐུ་རྩལ་སྟོབས་ཞེས་བྱའོ། །
en: Powerful Strength will be his attendant.

source: ཤེས་རབ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་ལྟ་མཆོད་ཅེས་བྱའོ། །
en: View and Worship will be foremost in terms of insight.

source: རྫུ་འཕྲུལ་ཅན་རྣམས་ཀྱི་མཆོག་ནི་རིན་ཆེན་མཐའ་ཡས་འོད་ཅེས་བྱའོ། །
en: Infinite Jewel Light will be foremost in terms of miraculous abilities.

source: འདུས་པ་ནི་ལན་ཉི་ཤུ་རྩ་གཉིས་ཏེ། ཐམས་ཅད་ལ་ཡང་ཐེར་འབུམ་ཐེར་འབུམ་མོ། །
en: There will be twenty-two consecutive congregations, each of them gathering one billion.
